tutorials/2206/hisDriftFluxFoam/flowCellCase/0.orig/V2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      V2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;


boundaryField
{
    PNe
    {
        type            fixedValue;
        value		uniform 0;
    }
    PPe
    {
        type            fixedValue;
        value		uniform 0;
    }
    frontAndBack
    {
	type		empty;
    }
    Inlet1
    {
	type            zeroGradient;
    }
    Inlet2
    {
	type            zeroGradient;
    }
    Outlet1
    {
        type            zeroGradient;
    }
        Outlet2
    {
        type            zeroGradient;
    }
        OWall
    {
        type            fixedValue;
        value		uniform 0;
        
    }
    IWall
    {
        type            fixedValue;
        value		uniform 0;
    }
    
}


// ************************************************************************* //
