tutorials/2206/hisDriftFluxFoam/flowCellCase/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
RDB		0.1e-3;
phases          (gas electrolyte);

gas
{
    transportModel  linearMu;

    rho             0.0645;
    nud		    1.44e-4;
    mu		    1e-5;
    
    //related to diffusion between phases.
    zeta	1;
    C_star	1; //rigid spheres
    Da		0.16;
    Db		0.81;
    D1_ref	1.213e-4;//depends on temperature and pressure. needs to be added at some point.

    "(Beckermann|Ishii|linearMu)Coeffs"
    {
    
    
    
    mu_ref_H2		    8.411e-6;
    mu_ref_O2		    1.919e-5;
    mu_ref_H2O		    9.81e-6;
    
    T_muref_H2		    273.15;
    T_muref_O2		    300;	//273.15
    T_muref_H2O		    300;
    
    n_mu_H2		    0.67;
    n_mu_O2		    0.754;
    n_mu_H2O		    1.1;
    
    //Ishii
    alpha_crit	    1;
    //Beckermann
    kr		1.5;//BECKKR;
    }
}

electrolyte
{
    	transportModel  Newtonian;

    	nu              1.6e-06;
    	rho             1231;
    	mu		1.968e-3;
}




relativeVelocityModel simpleIshiiTEST;//viscousRegime;//simpleIshii;//

"(simple|general|pSimple|distorted|viscousRegime)Coeffs"
{
    V0              (1e-9 0 0);
    a               -1;//-0.2;
    a1              0;
    residualAlpha   0;
}
"(distorted|viscousRegime)Coeffs"
{

    R_DB	$RDB;
    SurfaceTension 80e-3;
}
"(simpleIshii|simpleIshiiTEST)Coeffs"
{
    V0              (0.025 0 0);
    n               1.125;//2.4;
    D			0;//1;
}

coverageModel vogt;

"(linearCoverage|vogt|linearVogt|bubbleNeuclation|bubbleNeuclationLinear|zeroCoverage)Coeffs"
{
	//vogt
	J_lim		300000.0;   ///ffrom vogt
	J_scale		1;
	//bubbleNeuclation
	alpha_b		0.524;	//contact angle in rad
	tau_d		1;	//time scale of neuclation, to signify howmany bubbles are also growing at the same time
	d_b		0.1e-3;	//bubble neucleation diameter
	//bubbleNeucleationLinear
	
	d_ba		15.006e-9;
	d_bb		375.7e-6;
	
	tau_da		9.76e-6;
	tau_db		4.45;
}

concentrationLossModel localReference;

"(constantRatio|fixedReferenceValue|localReference)Coeffs"
{
stoichiometricCoefficient true; //use stoichiometricCoefficient as exponent CR[i]^n.:=
//used in "constantRatio"

//used in "fixedReferenceValue"
	C_ref_OH 	6851.19;
	C_ref_H2O 	48810;
	C_ref_H2 	1;
	C_ref_O2 	1;
	//exponent, CR[i]^n, all have to be specified, even when not truely used.
	n_Ne_H2		1;
	n_Ne_O2		1;
	n_Ne_H2O	2;
	n_Ne_OH		2;
	a_Ne		("H2");
	c_Ne		("H2O");
	
	
	n_Pe_H2		1;
	n_Pe_O2		0.5;
	n_Pe_H2O	1;
	n_Pe_OH		2;
	a_Pe		("OH");
	c_Pe		("O2");
	
}

speciesTransport
{
	sh_a	1.1;
	sh_b	0.43;
	sh_c	0.33;
}

massAndSpeciesTransferModel mixedSaturation;
"(surfaceSaturation|mixedSaturation|bulkSaturation)Coeffs"
{
	tau_c	0.01;
	tau_b	0.1;
	c_AB	4;//163; //angle=9deg
	K_DB	8e-05;
	K_AB	8e-05;
	R_DB	$RDB;
	/*c_AB_H2	100;//163; //angle=9deg
	c_AB_O2	100;//163; //angle=9deg
	K_DB_H2	3.71e-4;
	K_DB_O2	1.479e-4;
	K_AB_H2	1.283e-4;
	K_AB_O2	4.314e-5;
	R_DB_H2	0.5e-3;
	R_DB_O2	0.5e-3;*/
	a	1;	//mixing constant (a*C-C_sat)
	waterVapour 	true;
	m_KOH		7.65; //[mol/kg] 7.65-> 30wt%
}

p_num		101325;
T0		298; //reference temperature
mu_KOH		0.000581;	//extrapolated to 80C with data from from https://link.springer.com/content/pdf/10.1134/S0018151X20060127.pdf?pdf=button%20sticky (checked 23/01-2023)
Re_p		6.32;

//mole weight
MW_H2		2.01588e-3;	//kg/mol
MW_O2		31.9988e-3;	//kg/mol
MW_OH		17.007e-3;	//kg/mol
MW_H2O		18.01528e-3;	//kg/mol
MW_K		39.10e-3;	//kg/mol

// iterations to correct potentials and species
potentialCorrections	5;
speciesCorrections	2;

//other
n_Temp	0;

// ************************************************************************* //
